Documents/_СписаниеДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>_СписаниеДолга</Name>
			<BasedOn>
				<xr:Item>Document._ОжидаемоеПоступлениеДС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСКлиентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОжидаемоеПоступлениеДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ОжидаемоеПоступлениеДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/_ВзаиморасчетыСКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>_ВзаиморасчетыСКлиентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОжидаемоеПоступлениеДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ОжидаемоеПоступлениеДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/_СписаниеДолга/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ОжидаемоеПоступлениеДС") Тогда
		ОжидаемоеПоступлениеДС	 = ДанныеЗаполнения;
		Валюта					 = ДанныеЗаполнения.Валюта;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	_ВзаиморасчетыСКлиентамиОстатки.Валюта,
		               |	_ВзаиморасчетыСКлиентамиОстатки.СуммаОплатыОстаток
		               |ИЗ
		               |	РегистрНакопления._ВзаиморасчетыСКлиентами.Остатки(&Дата, ОжидаемоеПоступлениеДС = &ОжидаемоеПоступлениеДС) КАК _ВзаиморасчетыСКлиентамиОстатки";
		Запрос.УстановитьПараметр("Дата",					 МоментВремени());
		Запрос.УстановитьПараметр("ОжидаемоеПоступлениеДС",	 ОжидаемоеПоступлениеДС);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.СуммаОплатыОстаток > 0 Тогда
				Сумма	 = Выборка.СуммаОплатыОстаток;
				Валюта	 = Выборка.Валюта;
			Иначе
				
			КонецЕсли;
		Иначе
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ВЗАИМОРАСЧЕТЫ С КЛИЕНТАМИ
	Движения._ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движение						 = Движения._ВзаиморасчетыСКлиентами.Добавить();
	Движение.ВидДвижения			 = ВидДвиженияНакопления.Расход;
	Движение.Период					 = Дата;
	Движение.ОжидаемоеПоступлениеДС	 = ОжидаемоеПоступлениеДС;
	Движение.Контрагент				 = ОжидаемоеПоступлениеДС.Контрагент;
	Движение.СуммаОплаты			 = Сумма;
	Движение.Валюта					 = Валюта;
	
КонецПроцедуры
